general_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-6;
        relTol          1e-2;
    }

    "(U|sigma)"
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|sigma)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    50;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    outerCorrectorResidualControl
    {
	U
	{

		tolerance 1e-05;
		relTol	  0;
	}
	p
	{
		tolerance 5e-04;
		relTol	  0;		
	}

//        "sigma.*"
//            {
 //                   tolerance  1e-05;
   //                 relTol     0;
     //       }
    }

}

relaxationFactors
{
    fields
    {
	p	0.3;
	pFinal  1;
    }
    equations
    {
        ".*"   0.3;
    }
}

// ************************************************************************* //
